import 'BookModel.dart';

var categoryData = [
  {"icon": "Assets/Icons/world.svg", "lebel": "Documentary"},
  {"icon": "Assets/Icons/star.svg", "lebel": "Games"},

  {"icon": "Assets/Icons/plane.svg", "lebel": "Travel"},
  {"icon": "Assets/Icons/heart.svg", "lebel": "Romance"},
];

var bookData = [
  // lib/Models/BookModel.dart
  BookModel(
    id: "1",
    title: "তাওহীদ রিসালাত ও আখেরাত",
    description:
        "ইসলাম ধর্মে ইমানের মূল ভিত্তি বা স্তম্ভ হলো তিনটি: তাওহীদ (আল্লাহর একত্ববাদ), রিসালাত (নবী-রাসুলগণের প্রতি বিশ্বাস) এবং আখিরাত (পরকাল বা মৃত্যুপরবর্তী জীবন)। এই তিনটি বিষয়ের ওপর পূর্ণ বিশ্বাস স্থাপন করা ছাড়া কেউ মুসলিম হতে পারে না।",
    aboutauthor:
        "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
    audiolen: "1.37H",
    author: "সাইয়েদ আবুল আ’লা মওদুদী",
    bookurl: "Assets/Images/towhid-risalat-o-akherat.png",
    rating: 4.7,
    numberOfRatings: 123,
    pages: 40,
    category: "Documentary",
    price: "Free",
    // price: "",
  ),
  BookModel(
    id: "2",
    title: "কুরআনের চারটি মৌলিক পরিভাষা",
    description:
        "কুরআনের মূল বার্তা ও মানুষ-আল্লাহর সম্পর্ক বুঝতে সাইয়েদ আবুল আ'লা মওদূদী চিহ্নিত ইলাহ, রব, দ্বীন ও ইবাদত—এই চারটি পরিভাষা অত্যন্ত মৌলিক ও গুরুত্বপূর্ণ। এগুলোর মাধ্যমে পবিত্র কুরআনে তাওহীদ বা আল্লাহর একত্ববাদের ধারণা স্পষ্ট করা হয়েছে।",
    aboutauthor:
        "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
    audiolen: "NULL",
    author: "সাইয়েদ আবুল আ’লা মওদুদী",
    bookurl: "Assets/Images/quraner-charti-moulik-poribhasha.png",
    rating: 4.7,
    numberOfRatings: 123,
    pages: 109,
    price: "Free",
    category: "Documentary",
  ),
  BookModel(
    id: "3",
    title: "ইসলামী সংস্কৃতির মর্মকথা",
    description:
        "ইসলামী সংস্কৃতির মর্মকথা হলো আল-কুরআন ও সুন্নাহর নির্দেশিত মূল্যবোধের ওপর প্রতিষ্ঠিত একটি জীবনব্যবস্থা। এটি আল্লাহর একত্ববাদ (তাওহীদ), নৈতিকতা, ইনসাফ এবং মানবকল্যাণের চিরন্তন আদর্শ দ্বারা পরিচালিত হয়, যা মানুষের ব্যক্তি ও সমাজজীবনকে উন্নত ও পবিত্র করে তোলে।",
    aboutauthor:
        "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
    audiolen: "NULL",
    author: "সাইয়েদ আবুল আ’লা মওদুদী",
    bookurl: "Assets/Images/islami-shongskritir-mormokotha.png",
    rating: 4.7,
    numberOfRatings: 123,
    pages: 246,
    price: "Free",
    category: "Documentary",
  ),
  BookModel(
    id: "4",
    title: "সত্যের সাক্ষ্য",
    description:
        "সত্যের সাক্ষ্য হলো প্রখ্যাত ইসলামী চিন্তাবিদ ও জামায়াতে ইসলামীর প্রতিষ্ঠাতা সাইয়েদ আবুল আলা মওদূদী (র.)-এর একটি ঐতিহাসিক ও বিখ্যাত ভাষণ। ১৯৪৬ সালের ৩০শে ডিসেম্বর লাহোরে জামায়াতে ইসলামীর সম্মেলনে তিনি এই মূল্যবান ভাষণটি প্রদান করেন, যা পরবর্তীতে গ্রন্থাকারে প্রকাশিত হয়।",
    aboutauthor:
        "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
    audiolen: "NULL",
    author: "সাইয়েদ আবুল আ’লা মওদুদী",
    bookurl: "Assets/Images/shotter-sakkhi.png",
    rating: 4.7,
    numberOfRatings: 123,
    pages: 42,
    price: "Free",
    category: "Documentary",
  ),
  BookModel(
    id: "5",
    title: "দা’য়ী ইলাল্লাহ-দা’ওয়াত ইলাল্লাহ",
    description:
        "দাওয়াত ইলাল্লাহ অর্থ আল্লাহর দিকে বা তাঁর দ্বীনের দিকে মানুষকে আহ্বান করা। আর যিনি এই মহান দায়িত্ব পালন করেন, তাকে দায়ী ইলাল্লাহ বলা হয়। ",
    aboutauthor:
        "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
    audiolen: "NULL",
    author: "সাইয়েদ আবুল আ’লা মওদুদী",
    bookurl: "Assets/Images/dayi-ilallah-dawat-ilallah.png",
    rating: 4.7,
    numberOfRatings: 123,
    pages: 50,
    price: "Free",
    category: "Documentary",
  ),
  BookModel(
    id: "6",
    title: "ইসলামী দাওয়াত ও কর্মনীতি",
    description:
        "ইসলামী দাওয়াত ও কর্মনীতি হলো প্রখ্যাত ইসলামী চিন্তাবিদ ও জামায়াতে ইসলামীর প্রতিষ্ঠাতা মাওলানা সাইয়েদ আবুল আ'লা মওদুদী রচিত একটি বিখ্যাত বই ও তাত্ত্বিক নির্দেশিকা। এই গ্রন্থে ইসলামের সঠিক বার্তা মানুষের কাছে পৌঁছানোর পদ্ধতি, আদর্শ জীবনব্যবস্থা প্রতিষ্ঠার রূপরেখা এবং ইসলামী আন্দোলনের কর্মীদের সঠিক কর্মপন্থা ও আচরণ সম্পর্কে বিস্তারিত আলোচনা করা হয়েছে।",
    aboutauthor:
        "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
    audiolen: "NULL",
    author: "সাইয়েদ আবুল আ’লা মওদুদী",
    bookurl: "Assets/Images/islami-dawat-o-kormoniti.png",
    rating: 4.7,
    numberOfRatings: 123,
    pages: 42,
    price: "Free",
    category: "Documentary",
  ),
  BookModel(
    id: "7",
    title: "ইসলামের হাকীকত",
    description:
        "ইসলাম অর্থ আত্মসমর্পণ বা আনুগত্য করা। আর 'হাকীকত' অর্থ বাস্তব রূপ, মূল তত্ত্ব বা সত্য। পরিভাষায় ইসলামের হাকীকত হলো আল্লাহর একত্ববাদ বা তাওহীদ মেনে নেওয়া এবং তাঁর সম্পূর্ণ বিধানের কাছে বিনা শর্তে নিজের প্রবৃত্তি ও ইচ্ছাকে সমর্পণ করা। এটি শুধু কিছু আনুষ্ঠানিকতা নয়, বরং মানবজীবনের পূর্ণাঙ্গ জীবনব্যবস্থা।",
    aboutauthor:
        "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
    audiolen: "NULL",
    author: "সাইয়েদ আবুল আ’লা মওদুদী (র)",
    bookurl: "Assets/Images/islam-er hakikat.png",
    rating: 4.7,
    numberOfRatings: 123,
    pages: 48,
    price: "Free",
    category: "Documentary",
  ),

  BookModel(
    id: "8",
    title: "নামাজ রোজার হাকীকত",
    description:
        "নামাজ ও রোজার হাকীকত বা প্রকৃত তাৎপর্য হলো বাহ্যিক আনুষ্ঠানিকতার ঊর্ধ্বে ওঠে আল্লাহর দাসত্ব ও আনুগত্যের চেতনায় জীবনকে গড়া। নামাজ দিনে পাঁচবার মানুষকে মনে করিয়ে দেয় যে সে আল্লাহর গোলাম। আর রোজা বছরের একটি পুরো মাস সেই দাসত্ব ও খোদাভীতির প্রশিক্ষণ দেয়, যাতে মানুষ তার প্রবৃত্তি নিয়ন্ত্রণ করতে শেখে",
    aboutauthor:
        "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
    audiolen: "NULL",
    author: "সাইয়েদ আবুল আ’লা মওদুদী (র)",
    bookurl: "Assets/Images/namaj-rojar hakikat.png",
    rating: 4.7,
    numberOfRatings: 123,
    pages: 63,
    price: "Free",
    category: "Documentary",
  ),
  BookModel(
    id: "9",
    title: "যাকাতের হাকীকত",
    description:
        "যাকাতের আভিধানিক অর্থ পবিত্রতা, পরিচ্ছন্নতা ও বৃদ্ধি পাওয়া। শরিয়তের পরিভাষায়, নিসাব পরিমাণ সম্পদের মালিক হলে নির্দিষ্ট একটি অংশ (সাধারণত ২.৫%) আল্লাহর সন্তুষ্টির জন্য গরিব ও হকদারদের মাঝে নিয়মিত বিতরণ করা। এটি ইসলামের তৃতীয় রোকন বা ভিত্তি এবং ধনী ও দরিদ্রের মধ্যকার ব্যবধান দূর করার একটি কার্যকর মাধ্যম।",
    aboutauthor:
        "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
    audiolen: "NULL",
    author: "সাইয়েদ আবুল আ’লা মওদুদী (র)",
    bookurl: "Assets/Images/jakat-er hakikat.png",
    rating: 4.7,
    numberOfRatings: 123,
    pages: 49,
    price: "Free",
    category: "Documentary",
  ),
  BookModel(
    id: "10",
    title: "হজ্জের হাকীকত",
    description:
        "হজ্জ অর্থ কোনো মহৎ কাজের বা নির্দিষ্ট স্থান জিয়ারতের সঙ্কল্প করা। ইসলামী শরীফ মতে, শারীরিক ও আর্থিকভাবে সক্ষম প্রতিটি মুসলিম নর-নারীর জন্য জীবনে অন্তত একবার মক্কার পবিত্র কাবা শরীফ ও সংশ্লিষ্ট স্থানসমূহ নির্দিষ্ট সময়ে জিয়ারত করা ফরজ বা বাধ্যতামূলক ইবাদত, যা ইসলামের পঞ্চম স্তম্ভ।",
    aboutauthor:
        "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
    audiolen: "NULL",
    author: "সাইয়েদ আবুল আ’লা মওদুদী (র)",
    bookurl: "Assets/Images/hajj-er hakikat.png",
    rating: 4.7,
    numberOfRatings: 123,
    pages: 42,
    price: "Free",
    category: "Documentary",
  ),
  BookModel(
    id: "11",
    title: "জিহাদের হাকীকত",
    description:
        "ইসলামি পরিভাষায় 'জিহাদ' শব্দের অর্থ হলো আল্লাহর পথে সর্বশক্তি দিয়ে প্রচেষ্টা চালানো বা সংগ্রাম করা। এটি কেবল কোনো নিছক যুদ্ধ বা সহিংসতা নয়; বরং মন, চরিত্র, সমাজ এবং আল্লাহর সন্তুষ্টি অর্জনের জন্য আত্মিক ও নৈতিক এক বহুমুখী সাধনা। বিশিষ্ট ইসলামি চিন্তাবিদ সাইয়েদ আবুল আ'লা মওদূদী (রহ:) তাঁর বিখ্যাত জিহাদের হাকীকত বইটিতে এই ধারণাটি অত্যন্ত সুন্দরভাবে ফুটিয়ে তুলেছেন।",
    aboutauthor:
        "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
    audiolen: "NULL",
    author: "সাইয়েদ আবুল আ’লা মওদুদী (র)",
    bookurl: "Assets/Images/jihad-er hakikat.png",
    rating: 4.7,
    numberOfRatings: 123,
    pages: 27,
    price: "Free",
    category: "Documentary",
  ),
  BookModel(
    id: "12",
    title: "ইসলাম পরিচিতি",
    description:
        "ইসলাম হলো একত্ববাদী ও পূর্ণাঙ্গ জীবনবিধান। আরবি ‘সিল্ম’ বা ‘ইসলাম’ শব্দটির শাব্দিক অর্থ আত্মসমর্পণ করা, অনুগত হওয়া ও শান্তি লাভ করা। পরিভাষায়, আল্লাহ তায়ালার একক সত্তার প্রতি পূর্ণ বিশ্বাস স্থাপন করে তাঁর আদেশ-নিষেধ মেনে চলার মাধ্যমে তাঁর নিকট আত্মসমর্পণ করাই ইসলাম। এটি মানবজাতির জন্য প্রেরিত শেষ আসমানী ধর্ম।",
    aboutauthor:
        "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
    audiolen: "NULL",
    author: "সাইয়েদ আবুল আ’লা মওদুদী (র)",
    bookurl: "Assets/Images/islam-poricity-resize.png",
    rating: 4.7,
    numberOfRatings: 123,
    pages: 112,
    price: "Free",
    category: "Documentary",
  ),
  BookModel(
    id: "13",
    title: "শান্তিপথ",
    description:
        "শান্তিপথ হলো বিখ্যাত ইসলামী চিন্তাবিদ ও জামায়াতে ইসলামীর প্রতিষ্ঠাতা সাইয়েদ আবুল আ'লা মওদূদী রচিত একটি সুপরিচিত ইসলামী বই বা লিফলেট। অন্যদিকে, এটি ভারতের নতুন দিল্লির চাণক্যপুরী এলাকার একটি বিখ্যাত কূটনৈতিক সড়কের নামও বটে, যার হিন্দি অর্থ 'শান্তি সড়ক'।",
    aboutauthor:
        "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
    audiolen: "NULL",
    author: "সাইয়েদ আবুল আ’লা মওদুদী (র)",
    bookurl: "Assets/Images/shanti poth.png",
    rating: 4.7,
    numberOfRatings: 123,
    pages: 26,
    price: "Free",
    category: "Documentary",
  ),
  BookModel(
    id: "14",
    title: "ইসলামের জীবন পদ্ধতি",
    description:
        "ইসলাম শুধু কিছু নির্দিষ্ট আচার-অনুষ্ঠানের নাম নয়; এটি মানুষের জন্ম থেকে মৃত্যু পর্যন্ত সব কাজের একটি পূর্ণাঙ্গ জীবন পদ্ধতি। পবিত্র কুরআন ও মহানবী হজরত মুহাম্মদ (সা.)-এর সুন্নাহর আলোকে এটি ব্যক্তিগত বিশ্বাস, নৈতিকতা, পরিবার, সমাজ, অর্থনীতি ও রাষ্ট্র পরিচালনার সামগ্রিক নিয়ম ও দিকনির্দেশনা প্রদান করে।",
    aboutauthor:
        "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
    audiolen: "NULL",
    author: "সাইয়েদ আবুল আ’লা মওদুদী (র)",
    bookurl: "Assets/Images/islam-er jibon poddhoti.png",
    rating: 4.7,
    numberOfRatings: 123,
    pages: 46,
    price: "Free",
    category: "Documentary",
  ),
  BookModel(
    id: "15",
    title: "ইসলাম ও জাহেলিয়াত",
    description:
        "ইসলাম ও জাহেলিয়াত হলো দুটি সম্পূর্ণ বিপরীতমুখী জীবনব্যবস্থা, বিশ্বাস ও মতবাদ। ইসলাম আল্লাহর প্রেরিত জ্ঞান ও বিধানের ওপর প্রতিষ্ঠিত, আর জাহেলিয়াত অর্থ অজ্ঞতা, মূর্খতা বা আল্লাহর বিধানের বাইরের মানব রচিত মতবাদ। সত্য ও ন্যায়ের পথে মানবজাতিকে পরিচালিত করতে এই দুটির ধারণা অত্যন্ত স্পষ্ট।",
    aboutauthor:
        "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
    audiolen: "NULL",
    author: "সাইয়েদ আবুল আ’লা মওদুদী (র)",
    bookurl: "Assets/Images/islam-o-jaheliyat-resize.png",
    rating: 4.7,
    numberOfRatings: 123,
    pages: 34,
    price: "Free",
    category: "Documentary",
  ),
  BookModel(
    id: "16",
    title: "ইসলাম ও আধুনিক অর্থনৈতিক মতবাদ",
    description:
        "'ইসলাম ও আধুনিক অর্থনৈতিক মতবাদ' হলো প্রখ্যাত ইসলামী চিন্তাবিদ সাইয়েদ আবুল আ'লা মওদুদী কর্তৃক রচিত একটি বিখ্যাত গ্রন্থ, যেখানে পুঁজিবাদ ও সমাজতন্ত্রের মতো আধুনিক অর্থনৈতিক ব্যবস্থার তুলনামূলক আলোচনা এবং ইসলামী অর্থনীতির শাশ্বত ও ন্যায়ভিত্তিক রূপরেখা তুলে ধরা হয়েছে।",
    aboutauthor:
        "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
    audiolen: "NULL",
    author: "সাইয়েদ আবুল আ’লা মওদুদী (র)",
    bookurl: "Assets/Images/islam-o-andhunik-motobad.png",
    rating: 4.7,
    numberOfRatings: 123,
    pages: 119,
    price: "Free",
    category: "Documentary",
  ),
];
