import 'BookModel.dart';

var categoryData = [
  {
    "icon": "Assets/Icons/world.svg",
    "lebel":"Documentary"
  },
  {
    "icon": "Assets/Icons/star.svg",
    "lebel":"Games"
  },

  {
    "icon": "Assets/Icons/plane.svg",
    "lebel":"Travel"
  },
  {
    "icon": "Assets/Icons/heart.svg",
    "lebel":"Romance"
  },
];

var bookData = [
  // lib/Models/BookModel.dart
  BookModel(
    id: "1",
    title: "তাওহীদ রিসালাত ও আখেরাত",
    description: "ইসলাম ধর্মে ইমানের মূল ভিত্তি বা স্তম্ভ হলো তিনটি: তাওহীদ (আল্লাহর একত্ববাদ), রিসালাত (নবী-রাসুলগণের প্রতি বিশ্বাস) এবং আখিরাত (পরকাল বা মৃত্যুপরবর্তী জীবন)। এই তিনটি বিষয়ের ওপর পূর্ণ বিশ্বাস স্থাপন করা ছাড়া কেউ মুসলিম হতে পারে না।",
    aboutauthor: "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
    audiolen: "1.37H",
    author: "সাইয়েদ আবুল আ’লা মওদুদী",
    bookurl: "Assets/Images/towhid-risalat-o-akherat.png",
    rating: 4.7,
    numberOfRatings: 123,
    pages: 40,
    category: "Documentary",
    price: "Free",
    // price: "",
  ),
  BookModel(
      id: "2",
      title: "কুরআনের চারটি মৌলিক পরিভাষা",
      description: "কুরআনের মূল বার্তা ও মানুষ-আল্লাহর সম্পর্ক বুঝতে সাইয়েদ আবুল আ'লা মওদূদী চিহ্নিত ইলাহ, রব, দ্বীন ও ইবাদত—এই চারটি পরিভাষা অত্যন্ত মৌলিক ও গুরুত্বপূর্ণ। এগুলোর মাধ্যমে পবিত্র কুরআনে তাওহীদ বা আল্লাহর একত্ববাদের ধারণা স্পষ্ট করা হয়েছে।",
      aboutauthor: "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
      audiolen: "NULL",
      author: "সাইয়েদ আবুল আ’লা মওদুদী",
      bookurl: "Assets/Images/quraner-charti-moulik-poribhasha.png",
      rating: 4.7,
      numberOfRatings: 123,
      pages: 109,
      price: "Free",
      category: "Documentary"
  ),
  BookModel(
      id: "3",
      title: "ইসলামী সংস্কৃতির মর্মকথা",
      description: "ইসলামী সংস্কৃতির মর্মকথা হলো আল-কুরআন ও সুন্নাহর নির্দেশিত মূল্যবোধের ওপর প্রতিষ্ঠিত একটি জীবনব্যবস্থা। এটি আল্লাহর একত্ববাদ (তাওহীদ), নৈতিকতা, ইনসাফ এবং মানবকল্যাণের চিরন্তন আদর্শ দ্বারা পরিচালিত হয়, যা মানুষের ব্যক্তি ও সমাজজীবনকে উন্নত ও পবিত্র করে তোলে।",
      aboutauthor: "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
      audiolen: "NULL",
      author: "সাইয়েদ আবুল আ’লা মওদুদী",
      bookurl: "Assets/Images/islami-shongskritir-mormokotha.png",
      rating: 4.7,
      numberOfRatings: 123,
      pages: 246,
      price: "Free",
      category: "Documentary"
  ),
  BookModel(
      id: "4",
      title: "সত্যের সাক্ষ্য",
      description: "সত্যের সাক্ষ্য হলো প্রখ্যাত ইসলামী চিন্তাবিদ ও জামায়াতে ইসলামীর প্রতিষ্ঠাতা সাইয়েদ আবুল আলা মওদূদী (র.)-এর একটি ঐতিহাসিক ও বিখ্যাত ভাষণ। ১৯৪৬ সালের ৩০শে ডিসেম্বর লাহোরে জামায়াতে ইসলামীর সম্মেলনে তিনি এই মূল্যবান ভাষণটি প্রদান করেন, যা পরবর্তীতে গ্রন্থাকারে প্রকাশিত হয়।",
      aboutauthor: "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
      audiolen: "NULL",
      author: "সাইয়েদ আবুল আ’লা মওদুদী",
      bookurl: "Assets/Images/shotter-sakkhi.png",
      rating: 4.7,
      numberOfRatings: 123,
      pages: 42,
      price: "Free",
      category: "Documentary"
  ),
  BookModel(
      id: "5",
      title: "দা’য়ী ইলাল্লাহ-দা’ওয়াত ইলাল্লাহ",
      description: "দাওয়াত ইলাল্লাহ অর্থ আল্লাহর দিকে বা তাঁর দ্বীনের দিকে মানুষকে আহ্বান করা। আর যিনি এই মহান দায়িত্ব পালন করেন, তাকে দায়ী ইলাল্লাহ বলা হয়। ",
      aboutauthor: "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
      audiolen: "NULL",
      author: "সাইয়েদ আবুল আ’লা মওদুদী",
      bookurl: "Assets/Images/dayi-ilallah-dawat-ilallah.png",
      rating: 4.7,
      numberOfRatings: 123,
      pages: 50,
      price: "Free",
      category: "Documentary"
  ),
  BookModel(
      id: "6",
      title: "ইসলামী দাওয়াত ও কর্মনীতি",
      description: "ইসলামী দাওয়াত ও কর্মনীতি হলো প্রখ্যাত ইসলামী চিন্তাবিদ ও জামায়াতে ইসলামীর প্রতিষ্ঠাতা মাওলানা সাইয়েদ আবুল আ'লা মওদুদী রচিত একটি বিখ্যাত বই ও তাত্ত্বিক নির্দেশিকা। এই গ্রন্থে ইসলামের সঠিক বার্তা মানুষের কাছে পৌঁছানোর পদ্ধতি, আদর্শ জীবনব্যবস্থা প্রতিষ্ঠার রূপরেখা এবং ইসলামী আন্দোলনের কর্মীদের সঠিক কর্মপন্থা ও আচরণ সম্পর্কে বিস্তারিত আলোচনা করা হয়েছে।",
      aboutauthor: "সাইয়েদ আবুল আ’লা মওদুদী (২৫ সেপ্টেম্বর ১৯০৩ - ২২ সেপ্টেম্বর ১৯৭৯) ছিলেন বিংশ শতাব্দীর একজন প্রখ্যাত মুসলিম চিন্তাবিদ, সাংবাদিক, লেখক এবং জামায়াতে ইসলামীর প্রতিষ্ঠাতা। তিনি ভারতের ঔরঙ্গাবাদে জন্ম নেন। ইসলামি পুনর্জাগরণ এবং আধুনিক রাজনৈতিক ইসলামের বিকাশে তার গভীর প্রভাব রয়েছে। তার বিখ্যাত কাজের মধ্যে রয়েছে তাফহীমুল কুরআন তাফসীর গ্রন্থ।",
      audiolen: "NULL",
      author: "সাইয়েদ আবুল আ’লা মওদুদী",
      bookurl: "Assets/Images/islami-dawat-o-kormoniti.png",
      rating: 4.7,
      numberOfRatings: 123,
      pages: 42,
      price: "Free",
      category: "Documentary"
  ),
  BookModel(
      id: "7",
      title: "পর্দা ও ইসলাম",
      description: "",
      aboutauthor: "",
      audiolen: "20",
      author: "সাইয়েদ আবুল আ’লা মওদুদী (র)",
      bookurl: "Assets/Images/Porda o Islam.png",
      rating: 4.7,
      numberOfRatings: 123,
      price: "Free",
      category: "Documentary"
  ),
];